Revit 2027 API
TemporaryGraphicsCommandData Properties
The TemporaryGraphicsCommandData type exposes the following members.
Properties
Name | Description
Document |  The document.
Index |  The unique index of the temporary graphics object managed by TemporaryGraphicsManager.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace